
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_draft_store_access_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.citizen-ui-draft-store.azurerm_private_endpoint.this[0]
  * module.citizen-ui-draft-store.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_draft_store_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_draft_store_access_key" {
        id                      = "https://civil-cui-aat.vault.azure.net/secrets/draft-store-access-key/2e9a2546fd284f6eb75e64f794940845"
        name                    = "draft-store-access-key"
      ~ tags                    = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "redis civil-citizen-ui-draft-store-aat.redis.cache.windows.net"
        } -> (known after apply)
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.citizen-ui-draft-store.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat" -> (known after apply)
        name                     = "civil-citizen-ui-draft-store-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/networkInterfaces/civil-citizen-ui-draft-store-aat.nic.bb09c57d-833b-4f03-9640-d6a0231cf3ec"
              - name = "civil-citizen-ui-draft-store-aat.nic.bb09c57d-833b-4f03-9640-d6a0231cf3ec"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "civil-citizen-ui-draft-store-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.15",
                        ]
                      - name         = "civil-citizen-ui-draft-store-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Network/privateEndpoints/civil-citizen-ui-draft-store-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "civil-citizen-ui-draft-store-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Cache/redis/civil-citizen-ui-draft-store-aat" -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.15" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.citizen-ui-draft-store.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "civil-citizen-ui-draft-store-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-draft-store-cache-aat/providers/Microsoft.Cache/redis/civil-citizen-ui-draft-store-aat" -> (known after apply)
        name                          = "civil-citizen-ui-draft-store-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat|civil-cui-aat"
        name                           = "civil-cui-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2295,"Program":"tfcmt","SHA1":"","Vars":{}} -->